docs/architecture/proposals/PAY-329-load-testing/artillery/environments/1000-rpm.yml
config:
  target: "http://localhost:8080"
  # target: "https://aplnu5xea1.execute-api.us-east-1.amazonaws.com/pr-292"

  http:
    timeout: 60000
    pool: 50

  ensure:
    maxErrorRate: 100

  phases:
    - duration: 30
      arrivalRate: 2
      name: debug-low-load

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

    capture:
      json: true

  processor: "../processor.js"