docs/architecture/proposals/PAY-329-load-testing/artillery/environments/10000-rpm.yml
config:
  target: "http://localhost:8080"
  # target: "https://dev-payments.ustaxcourt.gov"

  phases:
    - duration: 300
      arrivalRate: 167
      name: stress-10000-rpm

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  processor: "../processor.js"