docs/architecture/proposals/PAY-329-load-testing/artillery/environments/ramp-test.yml
config:
  target: "http://localhost:8080"
  # target: "https://dev-payments.ustaxcourt.gov"

  http:
    timeout: 30

  ensure:
    maxErrorRate: 100

  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 167
      name: full-flow-ramp

  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  processor: "../processor.js"